[
    {
        "id": "1",
        "name": "Bruschetta",
        "description": "An Italian appetizer made with grilled bread topped with fresh tomatoes, basil, garlic, and olive oil. Bruschetta is best enjoyed as an appetizer, showcasing the vibrant flavors of ripe tomatoes and aromatic herbs.",
        "cuisine": "Italian",
        "difficulty": "Easy",
        "prepTime": "15 minutes",
        "cookTime": "10 minutes",
        "totalTime": "25 minutes",
        "servings": 4,
        "ingredients": [
            "4 slices of crusty Italian bread",
            "2 ripe tomatoes, diced",
            "1/4 cup fresh basil leaves, chopped",
            "2 cloves garlic, minced",
            "2 tablespoons extra-virgin olive oil",
            "1 tablespoon balsamic vinegar",
            "Salt, to taste",
            "Black pepper, to taste"
        ],
        "instructions": [
            "Preheat the oven to 375°F (190°C).",
            "Place the slices of bread on a baking sheet and drizzle them with olive oil. Toast in the preheated oven for about 8-10 minutes, or until the bread is crispy and golden brown.",
            "In a bowl, combine the diced tomatoes, minced garlic, chopped basil leaves, olive oil, and balsamic vinegar. Mix well to combine all the ingredients.",
            "Season the tomato mixture with salt and black pepper according to taste. Stir well.",
            "Remove the toasted bread from the oven and let it cool slightly. Rub each slice with a clove of garlic to infuse the bread with its flavor.",
            "Spoon the tomato mixture generously onto each slice of bread, spreading it evenly.",
            "Drizzle a little extra olive oil on top of the bruschetta for added flavor, if desired.",
            "Serve the bruschetta immediately as an appetizer or light snack.",
            "Enjoy the fresh and vibrant flavors of this classic Italian bruschetta!"
        ]
    },
    {
        "id": "2",
        "name": "Tiramisu",
        "description": "A classic Italian dessert consisting of layers of coffee-soaked ladyfingers and creamy mascarpone cheese. Best enjoyed after a meal as a sweet treat, Tiramisu delights with its rich flavors and delicate texture.",
        "cuisine": "Italian",
        "difficulty": "Intermediate",
        "prepTime": "30 minutes",
        "cookTime": "0 minutes",
        "totalTime": "6 hours",
        "servings": 8,
        "ingredients": [
            "6 egg yolks",
            "3/4 cup granulated sugar",
            "2/3 cup milk",
            "1 1/4 cups heavy cream",
            "8 oz mascarpone cheese",
            "1 teaspoon vanilla extract",
            "1 cup strong brewed coffee, cooled",
            "2 tablespoons unsweetened cocoa powder",
            "24 ladyfingers"
        ],
        "instructions": [
            "In a heatproof bowl, whisk together the egg yolks and sugar until well combined and creamy.",
            "Place the bowl over a pan of simmering water, making sure the bottom of the bowl doesn't touch the water. Cook, whisking constantly, until the mixture thickens and reaches about 160°F (70°C).",
            "Remove the bowl from heat and whisk in the milk. Let it cool to room temperature.",
            "In a separate bowl, beat the heavy cream until stiff peaks form.",
            "Gently fold the mascarpone cheese and vanilla extract into the cooled egg yolk mixture until well combined.",
            "Fold in half of the whipped cream into the mascarpone mixture until incorporated, then fold in the remaining whipped cream.",
            "Dip each ladyfinger into the brewed coffee and arrange them in a single layer in the bottom of a 9x13-inch dish.",
            "Spread half of the mascarpone mixture over the ladyfingers.",
            "Dust the layer with cocoa powder using a fine-mesh sieve.",
            "Repeat the layers with the remaining ladyfingers, mascarpone mixture, and cocoa powder.",
            "Cover the dish with plastic wrap and refrigerate for at least 6 hours, or overnight, to allow the flavors to meld together and for the tiramisu to set.",
            "Before serving, dust the top with additional cocoa powder.",
            "Slice and serve chilled. Enjoy!"
        ]
    },
    {
        "id":"3",
        "name": "Baklava",
        "description": "A sweet pastry made of layers of flaky phyllo dough filled with chopped nuts and sweetened with syrup or honey. Baklava is a delightful dessert often enjoyed with a cup of tea or coffee, perfect for satisfying a sweet tooth.",
        "cuisine": "Turkish/Middle Eastern",
        "difficulty": "Intermediate",
        "prepTime": "30 minutes",
        "cookTime": "45 minutes",
        "totalTime": "1 hour 15 minutes",
        "servings": 20,
        "ingredients": [
            "1 lb phyllo dough",
            "1 lb unsalted butter, melted",
            "2 cups finely chopped walnuts",
            "2 cups finely chopped pistachios",
            "1 cup granulated sugar",
            "1 tablespoon ground cinnamon",
            "1/2 teaspoon ground cloves",
            "1 cup water",
            "1 cup honey",
            "1 tablespoon lemon juice"
        ],
        "instructions": [
            "Preheat the oven to 350°F (175°C). Grease a 9x13-inch baking dish.",
            "In a medium bowl, combine the chopped walnuts, pistachios, sugar, cinnamon, and ground cloves. Mix well and set aside.",
            "Unroll the phyllo dough and place a damp cloth over it to prevent drying out.",
            "Place one sheet of phyllo dough into the baking dish and brush it generously with melted butter. Repeat this step with 7 more sheets, brushing each layer with butter.",
            "Sprinkle a generous amount of the nut mixture over the buttered phyllo layers.",
            "Continue layering phyllo sheets and brushing with butter between each layer, alternating with layers of the nut mixture, until all the nut mixture is used. Reserve a few sheets of phyllo for the top layer.",
            "Place the reserved sheets of phyllo on top, brushing each layer with butter.",
            "Using a sharp knife, cut the baklava into diamond or square shapes.",
            "Bake in the preheated oven for 45 minutes, or until the baklava turns golden brown and crispy.",
            "While the baklava is baking, prepare the syrup by combining water, honey, and lemon juice in a saucepan. Bring it to a boil and then simmer for 10 minutes. Remove from heat and let it cool.",
            "Once the baklava is cooked, remove it from the oven and immediately pour the cooled syrup over the hot baklava, ensuring it seeps into all the cuts.",
            "Allow the baklava to cool completely in the dish before serving. This will allow it to soak up the syrup and develop its signature sticky texture.",
            "Serve at room temperature and enjoy!"
        ]
    },
    {
        "id": "4",
        "name": "Chai Tea",
        "description": "A spiced Indian tea made with black tea, milk, and a blend of aromatic spices like cardamom, cinnamon, and ginger. Chai Tea is typically enjoyed as a warm and comforting beverage, perfect for relaxing moments or as an accompaniment to breakfast or afternoon tea.",
        "cuisine": "Indian",
        "difficulty": "Easy",
        "prepTime": "5 minutes",
        "cookTime": "15 minutes",
        "totalTime": "20 minutes",
        "servings": 2,
        "ingredients": [
            "2 cups water",
            "2 cups milk",
            "2 tablespoons loose black tea leaves",
            "2 tablespoons sugar (adjust to taste)",
            "2-3 whole green cardamom pods, lightly crushed",
            "1 small piece of cinnamon stick",
            "1/4 teaspoon grated ginger",
            "Pinch of ground cloves (optional)"
        ],
        "instructions": [
            "In a saucepan, add water, crushed cardamom pods, cinnamon stick, grated ginger, and ground cloves (if using). Bring it to a boil.",
            "Reduce the heat to low and add the loose black tea leaves. Simmer for 3-4 minutes to infuse the flavors into the water.",
            "Add milk and sugar to the saucepan. Stir well and simmer for another 5-7 minutes, allowing the tea to steep and the flavors to meld together.",
            "Strain the chai tea into cups or mugs using a fine mesh strainer or tea infuser to remove the tea leaves and spices.",
            "Serve the chai tea hot and enjoy its aromatic and comforting flavors.",
            "You can adjust the sweetness by adding more or less sugar according to your preference.",
            "Sit back, relax, and savor the deliciousness of homemade Chai Tea!"
        ]
    },
    {
        "id": "5",
        "name": "Irish Coffee",
        "description": "A delightful blend of hot coffee, Irish whiskey, sugar, and topped with whipped cream. Irish Coffee is a warming and indulgent drink, perfect for enjoying on chilly evenings or as a festive treat.",
        "cuisine": "Irish",
        "difficulty": "Easy",
        "prepTime": "5 minutes",
        "cookTime": "5 minutes",
        "totalTime": "10 minutes",
        "servings": 1,
        "ingredients": [
            "1 cup hot brewed coffee",
            "1 1/2 ounces Irish whiskey",
            "1 tablespoon brown sugar",
            "2 tablespoons heavy cream",
            "Whipped cream, for topping (optional)",
            "Cocoa powder or ground cinnamon, for garnish (optional)"
        ],
        "instructions": [
            "Pour the hot brewed coffee into a preheated glass or mug.",
            "Add the brown sugar to the coffee and stir until dissolved.",
            "Stir in the Irish whiskey until well combined.",
            "In a separate bowl, whip the heavy cream until it thickens slightly. It should still be pourable.",
            "Slowly pour the whipped cream over the back of a spoon onto the coffee mixture, allowing it to float on top.",
            "If desired, top with additional whipped cream and sprinkle with cocoa powder or ground cinnamon for garnish.",
            "Serve the Irish Coffee hot and enjoy the rich and delightful flavors!",
            "Note: Be careful while sipping the hot Irish Coffee, as the glass or mug may be hot."
        ]
    },
    {
        "id": "6",
        "name": "Samosas",
        "description": "A popular Indian snack made with crispy pastry dough filled with spiced potatoes, peas, and sometimes meat. Samosas are enjoyed as a savory snack or appetizer, often accompanied by chutney or dipping sauce.",
        "cuisine": "Indian",
        "difficulty": "Intermediate",
        "prepTime": "45 minutes",
        "cookTime": "20 minutes",
        "totalTime": "1 hour 5 minutes",
        "servings": 12,
        "ingredients": [
            "For the dough:",
            "2 cups all-purpose flour",
            "1/2 teaspoon salt",
            "4 tablespoons vegetable oil",
            "1/2 cup water",
            "For the filling:",
            "2 medium potatoes, boiled and mashed",
            "1/2 cup green peas",
            "1 small onion, finely chopped",
            "1 green chili, finely chopped",
            "1 teaspoon grated ginger",
            "1 teaspoon cumin seeds",
            "1 teaspoon coriander powder",
            "1/2 teaspoon turmeric powder",
            "1/2 teaspoon garam masala",
            "1 tablespoon chopped fresh cilantro",
            "Salt, to taste",
            "Oil, for frying"
        ],
        "instructions": [
            "In a large mixing bowl, combine the all-purpose flour and salt for the dough. Add the vegetable oil and mix well to form a crumbly texture.",
            "Gradually add water, little by little, and knead until the dough comes together. It should be smooth and firm. Cover the dough with a damp cloth and let it rest for 30 minutes.",
            "In a separate pan, heat a tablespoon of oil over medium heat. Add the cumin seeds and sauté until they start to crackle.",
            "Add the finely chopped onion, green chili, and grated ginger to the pan. Sauté until the onions turn golden brown.",
            "Add the green peas to the pan and cook for a few minutes until they are tender.",
            "Stir in the mashed potatoes, coriander powder, turmeric powder, garam masala, chopped cilantro, and salt. Mix well to combine all the ingredients. Remove from heat and let the filling cool.",
            "Divide the dough into equal-sized balls. Roll out each ball into a thin oval or circular shape. Cut the rolled dough in half to form two semicircles.",
            "Take one semicircle, wet the straight edge with water, and form a cone shape by overlapping the straight edges. Press to seal the edges.",
            "Fill the cone with a spoonful of the prepared filling. Apply water on the top edges and press to seal and close the cone, forming a triangular samosa shape. Repeat with the remaining dough and filling.",
            "Heat oil in a deep pan or fryer over medium heat. Once the oil is hot, carefully slide in a few samosas at a time and fry until golden brown and crispy. Remove with a slotted spoon and drain on paper towels to remove excess oil.",
            "Serve the samosas hot with mint chutney or tamarind chutney as a dipping sauce.",
            "Enjoy these delicious and crispy samosas as a snack or appetizer!"
        ]
    },
    {
        "id": "7",
        "name": "Empanadas",
        "description": "A savory pastry with a filling that varies from meat, cheese, or vegetables, folded into a half-moon shape and baked or fried. Empanadas are a delicious handheld meal or snack, perfect for enjoying on the go or as an appetizer.",
        "cuisine": "Latin American",
        "difficulty": "Intermediate",
        "prepTime": "1 hour",
        "cookTime": "20 minutes",
        "totalTime": "1 hour 20 minutes",
        "servings": 12,
        "ingredients": [
            "For the dough:",
            "3 cups all-purpose flour",
            "1 teaspoon salt",
            "1/2 cup unsalted butter, cold and cut into small cubes",
            "1/2 cup cold water",
            "For the filling:",
            "1 lb ground beef or your choice of filling",
            "1 tablespoon olive oil",
            "1 small onion, finely chopped",
            "2 cloves garlic, minced",
            "1 small bell pepper, finely chopped",
            "1/2 teaspoon ground cumin",
            "1/2 teaspoon paprika",
            "1/4 teaspoon chili powder",
            "Salt, to taste",
            "Black pepper, to taste",
            "1/4 cup chopped green olives",
            "1/4 cup raisins",
            "1 egg, beaten (for egg wash)"
        ],
        "instructions": [
            "In a large mixing bowl, combine the all-purpose flour and salt for the dough. Add the cold butter cubes and use your fingers or a pastry cutter to cut the butter into the flour until it resembles coarse crumbs.",
            "Gradually add the cold water, a little at a time, and mix until the dough comes together. Form the dough into a ball, wrap it in plastic wrap, and refrigerate for 30 minutes.",
            "In a skillet, heat the olive oil over medium heat. Add the chopped onion, minced garlic, and chopped bell pepper. Sauté until the vegetables are soft and the onion becomes translucent.",
            "Add the ground beef to the skillet and cook until browned. Drain any excess fat.",
            "Stir in the ground cumin, paprika, chili powder, salt, and black pepper. Mix well to combine.",
            "Add the chopped green olives and raisins to the skillet. Stir to incorporate the ingredients. Remove from heat and let the filling cool.",
            "Preheat the oven to 375°F (190°C).",
            "On a floured surface, roll out the chilled dough to a thickness of about 1/8 inch.",
            "Using a round cutter or a glass, cut out circles from the dough, about 4-6 inches in diameter.",
            "Place a spoonful of the cooled filling in the center of each dough circle. Fold the dough over the filling to create a half-moon shape. Use a fork to seal the edges by pressing down firmly.",
            "Place the empanadas on a baking sheet lined with parchment paper. Brush the tops of the empanadas with beaten egg to create a golden brown crust.",
            "Bake in the preheated oven for about 20 minutes, or until the empanadas are golden brown and crispy.",
            "Serve the empanadas warm as an appetizer or main dish. They can be enjoyed on their own or with your favorite dipping sauce.",
            "Enjoy these flavorful and savory empanadas!"
        ]
    },
    {
        "id": "8",
        "name": "Margarita",
        "description": "A classic Mexican cocktail made with tequila, lime juice, and triple sec, served over ice in a salt-rimmed glass. Margaritas are often enjoyed as a refreshing and tangy cocktail, perfect for social gatherings or to accompany Mexican cuisine.",
        "cuisine": "Mexican",
        "difficulty": "Easy",
        "prepTime": "5 minutes",
        "cookTime": "0 minutes",
        "totalTime": "5 minutes",
        "servings": 1,
        "ingredients": [
            "2 ounces tequila",
            "1 ounce lime juice",
            "1 ounce triple sec",
            "1 teaspoon agave nectar or simple syrup",
            "Salt, for rimming the glass (optional)",
            "Lime wedge, for garnish"
        ],
        "instructions": [
            "If desired, rim the glass with salt by moistening the rim with a lime wedge and dipping it into a shallow plate of salt. Set the glass aside.",
            "In a cocktail shaker, combine the tequila, lime juice, triple sec, and agave nectar (or simple syrup).",
            "Fill the shaker with ice and shake vigorously for about 15-20 seconds to thoroughly mix and chill the ingredients.",
            "Strain the cocktail into the prepared glass filled with ice cubes.",
            "Garnish the glass with a lime wedge for an extra touch.",
            "Serve the Margarita immediately and enjoy its refreshing and tangy flavors!",
            "Note: Feel free to adjust the sweetness or tartness of the Margarita by adding more or less agave nectar (or simple syrup) and lime juice, according to your taste preferences."
        ]
    },
    {
        "id": "9",
        "name": "Caesar Salad",
        "description": "A refreshing salad made with crisp romaine lettuce, Parmesan cheese, croutons, and a tangy dressing. Caesar Salad is often enjoyed as a starter or side dish, offering a balance of textures and flavors with each bite.",
        "cuisine": "International",
        "difficulty": "Easy",
        "prepTime": "15 minutes",
        "cookTime": "0 minutes",
        "totalTime": "15 minutes",
        "servings": 4,
        "ingredients": [
            "2 hearts of romaine lettuce, chopped",
            "1 cup croutons",
            "1/2 cup grated Parmesan cheese",
            "For the dressing:",
            "1/2 cup mayonnaise",
            "2 tablespoons lemon juice",
            "1 tablespoon Dijon mustard",
            "2 cloves garlic, minced",
            "2 anchovy fillets, finely chopped (optional)",
            "1/4 cup grated Parmesan cheese",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper"
        ],
        "instructions": [
            "In a large salad bowl, combine the chopped romaine lettuce, croutons, and grated Parmesan cheese.",
            "In a separate bowl, prepare the dressing by whisking together the mayonnaise, lemon juice, Dijon mustard, minced garlic, chopped anchovy fillets (if using), grated Parmesan cheese, salt, and black pepper. Mix until well combined.",
            "Pour the dressing over the salad ingredients in the salad bowl.",
            "Using salad tongs or two large spoons, toss the salad gently to evenly coat the lettuce with the dressing and distribute the ingredients.",
            "Continue tossing until all the lettuce leaves are coated and the dressing is well incorporated.",
            "Serve the Caesar Salad immediately as a refreshing and delicious appetizer or side dish.",
            "You can optionally garnish the salad with additional grated Parmesan cheese and croutons for added texture and flavor.",
            "Enjoy this classic Caesar Salad, packed with flavor and crispness!"
        ]
    },
    {
        "id": "10",
        "name": "Hamburger",
        "description": "A classic and beloved sandwich made with a juicy beef patty served on a bun, topped with various condiments and vegetables. Best enjoyed as a main course during casual meals, hamburgers are a popular choice for their satisfying flavors and endless customization options.",
        "cuisine": "American",
        "difficulty": "Easy",
        "prepTime": "15 minutes",
        "cookTime": "10 minutes",
        "totalTime": "25 minutes",
        "servings": 4,
        "ingredients": [
            "1 lb ground beef",
            "1 teaspoon salt",
            "1/2 teaspoon black pepper",
            "4 hamburger buns",
            "4 slices of cheese",
            "4 lettuce leaves",
            "4 tomato slices",
            "4 onion slices",
            "Ketchup, mustard, mayonnaise, or other desired condiments"
        ],
        "instructions": [
            "Preheat the grill or stovetop pan over medium-high heat.",
            "In a bowl, season the ground beef with salt and black pepper. Gently mix to combine.",
            "Divide the seasoned ground beef into four equal portions and shape them into patties, about 1/2 inch thick.",
            "Grill or cook the hamburger patties for about 4-5 minutes per side, or until they reach the desired level of doneness.",
            "During the last minute of cooking, place a slice of cheese on top of each patty and allow it to melt.",
            "Meanwhile, lightly toast the hamburger buns on the grill or in a toaster.",
            "To assemble the hamburgers, place a lettuce leaf on the bottom half of each bun, followed by a tomato slice and an onion slice.",
            "Place a cooked hamburger patty with melted cheese on top of the onions.",
            "Add any desired condiments such as ketchup, mustard, or mayonnaise on the top half of the bun.",
            "Cover the hamburger with the top half of the bun and serve immediately.",
            "Enjoy your delicious homemade hamburger!"
        ]
    },
    {
        "id": "11",
        "name": "Cheesecake",
        "description": "A rich and creamy dessert made with a sweet graham cracker crust and a velvety cream cheese filling. Cheesecake is a versatile dessert that can be enjoyed on any occasion, offering a luscious and indulgent experience.",
        "cuisine": "American",
        "difficulty": "Intermediate",
        "prepTime": "20 minutes",
        "cookTime": "1 hour",
        "totalTime": "6 hours 20 minutes",
        "servings": 12,
        "ingredients": [
            "2 cups graham cracker crumbs",
            "1/2 cup unsalted butter, melted",
            "32 oz cream cheese, softened",
            "1 1/2 cups granulated sugar",
            "4 large eggs",
            "1 cup sour cream",
            "1 teaspoon vanilla extract",
            "1/4 cup all-purpose flour"
        ],
        "instructions": [
            "Preheat the oven to 325°F (165°C). Grease a 9-inch springform pan.",
            "In a medium bowl, combine the graham cracker crumbs and melted butter. Mix well until the crumbs are evenly coated.",
            "Press the crumb mixture into the bottom of the prepared springform pan, forming an even crust.",
            "In a large mixing bowl, beat the cream cheese and sugar until smooth and creamy.",
            "Add the eggs, one at a time, beating well after each addition. Scrape down the sides of the bowl as needed.",
            "Add the sour cream and vanilla extract, and beat until well combined.",
            "Gradually add the flour and mix until just incorporated. Be careful not to overmix.",
            "Pour the cream cheese mixture over the crust in the springform pan.",
            "Smooth the top with a spatula, ensuring it is evenly distributed.",
            "Bake in the preheated oven for 1 hour, or until the edges are set and the center is slightly jiggly.",
            "Turn off the oven and leave the cheesecake inside for 1 hour to cool slowly.",
            "Remove the cheesecake from the oven and let it cool completely at room temperature.",
            "Refrigerate the cheesecake for at least 4 hours, preferably overnight, to allow it to set and chill.",
            "Before serving, run a knife around the edges of the pan to loosen the cheesecake. Carefully remove the springform pan sides.",
            "Slice and serve chilled. Enjoy!"
        ]
    },
    {
        "id": "12",
        "name": "Butter Chicken",
        "description": "A flavorful Indian dish featuring tender chicken cooked in a creamy tomato-based sauce, infused with aromatic spices. Butter Chicken is often served with rice or naan bread, offering a delightful combination of savory flavors and creamy textures.",
        "cuisine": "Indian",
        "difficulty": "Intermediate",
        "prepTime": "20 minutes",
        "cookTime": "40 minutes",
        "totalTime": "1 hour",
        "servings": 4,
        "ingredients": [
            "1 lb boneless, skinless chicken thighs, cut into bite-sized pieces",
            "1 cup plain yogurt",
            "2 tablespoons lemon juice",
            "2 teaspoons ground cumin",
            "2 teaspoons ground coriander",
            "1 teaspoon ground turmeric",
            "1 teaspoon chili powder",
            "1 teaspoon garam masala",
            "1 teaspoon paprika",
            "4 tablespoons unsalted butter",
            "1 large onion, finely chopped",
            "4 cloves garlic, minced",
            "1 tablespoon grated fresh ginger",
            "1 can (14 oz) tomato sauce",
            "1 cup heavy cream",
            "1/4 cup chopped fresh cilantro",
            "Salt, to taste",
            "Cooked basmati rice, for serving",
            "Naan bread, for serving"
        ],
        "instructions": [
            "In a bowl, combine the chicken, yogurt, lemon juice, cumin, coriander, turmeric, chili powder, garam masala, and paprika. Mix well to coat the chicken evenly. Cover and marinate in the refrigerator for at least 1 hour, or overnight for best results.",
            "In a large skillet or pan, melt the butter over medium heat. Add the chopped onion and cook until softened and golden brown, about 5-6 minutes.",
            "Add the minced garlic and grated ginger to the pan. Sauté for another 1-2 minutes until fragrant.",
            "Add the marinated chicken to the pan, along with any remaining marinade. Cook for 8-10 minutes, stirring occasionally, until the chicken is browned and cooked through.",
            "Pour in the tomato sauce and stir to combine with the chicken. Reduce the heat to low, cover, and simmer for 15-20 minutes to allow the flavors to meld together.",
            "Stir in the heavy cream and chopped cilantro. Season with salt to taste. Simmer for an additional 5 minutes.",
            "Serve the butter chicken over cooked basmati rice, garnished with additional cilantro if desired. Serve with naan bread on the side.",
            "Enjoy this delicious butter chicken with its creamy and flavorful sauce!"
        ]
    },
    {
        "id": "13",
        "name": "Tacos",
        "description": "A versatile Mexican dish consisting of a tortilla filled with various ingredients such as seasoned meat, salsa, cheese, and vegetables. Tacos are a fun and delicious meal enjoyed for lunch or dinner, allowing for personalization with different fillings and toppings.",
        "cuisine": "Mexican",
        "difficulty": "Easy",
        "prepTime": "15 minutes",
        "cookTime": "15 minutes",
        "totalTime": "30 minutes",
        "servings": 4,
        "ingredients": [
            "1 lb ground beef",
            "1 tablespoon olive oil",
            "1 small onion, diced",
            "2 cloves garlic, minced",
            "1 tablespoon chili powder",
            "1 teaspoon ground cumin",
            "1/2 teaspoon paprika",
            "1/2 teaspoon dried oregano",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper",
            "1/4 cup tomato sauce",
            "1/4 cup water",
            "8 small corn tortillas",
            "1 cup shredded lettuce",
            "1 cup diced tomatoes",
            "1/2 cup shredded cheddar cheese",
            "1/4 cup chopped fresh cilantro",
            "Sour cream and salsa, for serving"
        ],
        "instructions": [
            "In a skillet, heat the olive oil over medium heat. Add the diced onion and minced garlic, and sauté until the onion becomes translucent.",
            "Add the ground beef to the skillet and cook, breaking it up with a spoon, until browned and cooked through.",
            "Add the chili powder, ground cumin, paprika, dried oregano, salt, and black pepper to the skillet. Stir well to coat the beef with the spices.",
            "Pour in the tomato sauce and water. Stir to combine and simmer for about 5 minutes to allow the flavors to meld together. Remove from heat.",
            "Heat the corn tortillas in a separate dry skillet or over an open flame for a few seconds on each side until warm and pliable.",
            "To assemble the tacos, place a spoonful of the ground beef mixture onto each tortilla. Top with shredded lettuce, diced tomatoes, shredded cheddar cheese, and chopped cilantro.",
            "Serve the tacos with sour cream and salsa on the side.",
            "Enjoy your flavorful and delicious homemade tacos!"
        ]
    }
]